[{"content": "summarize this text:  Centrally your whole approach represents a rejection of the empirical tradition in philosophy, doesn't it? Because, I mean, the very fact that you think that the empiricists are wrong about how we learn must mean that they're wrong about knowledge and the nature of knowledge and the nature of knowledge has been the central problem in the very a tradition of extreme importance in that a particular theory of the origins of knowledge of the science of human nature and human's phrase was put forth. An empirical theory, and I think Hume, for example, would regard it as an empirical theory, and did regard it. So, when we investigate it, I think we discover that it's just completely false. That is, that the mechanisms that he discussed are not the mechanisms by which the mind reaches states of knowledge, that the states of knowledge attained are radically different than the kinds that he discussed. For example, for Hume, the mind was in his image a kind of a theater in which ideas paraded across the stage. And we therefore followed necessarily that we could introspect completely into the contents of our mind. If an idea is not on the stage, it's not in the mind. And the ideas may be connected and associated. In fact, he went on to say there isn't even any theater that addressed the ideas in that respect, the images misleading. is to the history of Western thought, for example, that same image dominates the rationalist tradition as well, where it was assumed that one could exhaust the contents of the mind by careful attention, you know, you could really develop those clear and distinct ideas and their consequences and so on. And in fact, even if you move to someone, let's say, like Freud, with his evocation of the unconscious, still I think that a careful reading suggests that he regarded the unconscious as in principle accessible, that is, we could really perceive that theater and stage and the things on it carefully if only the barriers of repression and so on could be overcome. Well, if what I've been suggesting is correct that's just that's radically wrong. I mean even long as a point departure. There is no reason at all that I can say for believing that the principles of mental computation that enter so intimately into our action or interaction or our speech to believe that those principles are at all accessible to introspection any more than the analyzing mechanisms of our visual system or for that matter the nature of our liver is accessible to introspection. It changes me that over and over again you come back to the same point. That is to say that many of the particular problems discussed and theories put forward by philosophers in the main but also psychologists, you've just mentioned Freud and in your writings you've mentioned many others, are in fact theories about physical processes. they are therefore open to checking by investigation, and when you check by investigation, you find out that the theories are wrong. And therefore, you are as it were radically subversive of a lot of very well-established theories in our tradition. It seems to me that what you put forward in their place over and over again, in fact, does parallel the rationalist tradition. I said in my introduction to this program that what I'm always reminded of by your work is the theories of Kant, who I've tried to bring it out in a certain way. However, I haven't myself specifically referred to Kant, but rather to the primarily to the 17th century tradition of the continental corrections and the British neoplatonists who developed many of the ideas that are now much more familiar in the writings of Kant. For example, the idea of experience conforming to our mode of cognition or the, well, particularly the British Platonists. For example, there are, I believe, is a rich line of insight into the organizing principles of the mind by which experience is structured. In fact, I think that some of the richest sociopsychological insights that I know, and that's the one. It's this tradition that I think can be fleshed out and made more explicit by the kinds of empirical inquiry that are now possible of course I think we also have to diverge from that tradition and the number of respects I've mentioned one namely the belief that the contents of the mind are of an introspection. Similarly, there's certainly no reason to accept the metaphysics of that tradition, to believe that there's a dualism of mind and body. You can see why the Cartesians were led to that. It was a rational move on their part, but it's not a move that we have to follow, we have other ways of approaching that question.", "additional_kwargs": {}, "type": "human", "example": false}, {"content": " The text describes an approach in philosophy that rejects the empirical tradition. This rejection is based on the idea that the mechanisms discussed by empiricists such as Hume are not the mechanisms by which the mind reaches states of knowledge. The author argues that the contents of the mind cannot be introspected completely and that many theories put forward by philosophers and psychologists are open to checking by investigation, but are found to be wrong. The author suggests that what is put forward in their place is similar to the rationalist tradition, with ideas such as experience conforming to our mode of cognition and organizing principles of the mind being structured by experience. However, the author also diverges from this tradition in some respects, such as the belief that the contents of the mind are introspectable and the metaphysics of dualism between mind and body.", "additional_kwargs": {}, "type": "ai", "example": false}, {"content": "summarize this text:  Centrally your whole approach represents a rejection of the empirical tradition in philosophy, doesn't it? Because, I mean, the very fact that you think that the empiricists are wrong about how we learn must mean that they're wrong about knowledge and the nature of knowledge and the nature of knowledge has been the central problem in the very a tradition of extreme importance in that a particular theory of the origins of knowledge of the science of human nature and human's phrase was put forth. An empirical theory, and I think Hume, for example, would regard it as an empirical theory, and did regard it. So, when we investigate it, I think we discover that it's just completely false. That is, that the mechanisms that he discussed are not the mechanisms by which the mind reaches states of knowledge, that the states of knowledge attained are radically different than the kinds that he discussed. For example, for Hume, the mind was in his image a kind of a theater in which ideas paraded across the stage. And we therefore followed necessarily that we could introspect completely into the contents of our mind. If an idea is not on the stage, it's not in the mind. And the ideas may be connected and associated. In fact, he went on to say there isn't even any theater that addressed the ideas in that respect, the images misleading. is to the history of Western thought, for example, that same image dominates the rationalist tradition as well, where it was assumed that one could exhaust the contents of the mind by careful attention, you know, you could really develop those clear and distinct ideas and their consequences and so on. And in fact, even if you move to someone, let's say, like Freud, with his evocation of the unconscious, still I think that a careful reading suggests that he regarded the unconscious as in principle accessible, that is, we could really perceive that theater and stage and the things on it carefully if only the barriers of repression and so on could be overcome. Well, if what I've been suggesting is correct that's just that's radically wrong. I mean even long as a point departure. There is no reason at all that I can say for believing that the principles of mental computation that enter so intimately into our action or interaction or our speech to believe that those principles are at all accessible to introspection any more than the analyzing mechanisms of our visual system or for that matter the nature of our liver is accessible to introspection. It changes me that over and over again you come back to the same point. That is to say that many of the particular problems discussed and theories put forward by philosophers in the main but also psychologists, you've just mentioned Freud and in your writings you've mentioned many others, are in fact theories about physical processes. they are therefore open to checking by investigation, and when you check by investigation, you find out that the theories are wrong. And therefore, you are as it were radically subversive of a lot of very well-established theories in our tradition. It seems to me that what you put forward in their place over and over again, in fact, does parallel the rationalist tradition. I said in my introduction to this program that what I'm always reminded of by your work is the theories of Kant, who I've tried to bring it out in a certain way. However, I haven't myself specifically referred to Kant, but rather to the primarily to the 17th century tradition of the continental corrections and the British neoplatonists who developed many of the ideas that are now much more familiar in the writings of Kant. For example, the idea of experience conforming to our mode of cognition or the, well, particularly the British Platonists. For example, there are, I believe, is a rich line of insight into the organizing principles of the mind by which experience is structured. In fact, I think that some of the richest sociopsychological insights that I know, and that's the one. It's this tradition that I think can be fleshed out and made more explicit by the kinds of empirical inquiry that are now possible of course I think we also have to diverge from that tradition and the number of respects I've mentioned one namely the belief that the contents of the mind are of an introspection. Similarly, there's certainly no reason to accept the metaphysics of that tradition, to believe that there's a dualism of mind and body. You can see why the Cartesians were led to that. It was a rational move on their part, but it's not a move that we have to follow, we have other ways of approaching that question.", "additional_kwargs": {}, "type": "human", "example": false}, {"content": " The text describes an approach in philosophy that rejects the empirical tradition. This rejection is based on the idea that the mechanisms discussed by empiricists such as Hume are not the mechanisms by which the mind reaches states of knowledge. The author argues that the contents of the mind cannot be introspected completely and that many theories put forward by philosophers and psychologists are open to checking by investigation, but are found to be wrong. The author suggests that what is put forward in their place is similar to the rationalist tradition, with ideas such as experience conforming to our mode of cognition and organizing principles of the mind being structured by experience. However, the author also diverges from this tradition in some respects, such as the belief that the contents of the mind are introspectable and the metaphysics of dualism between mind and body.", "additional_kwargs": {}, "type": "ai", "example": false}, {"content": "could you summarize in one sentence the gist?", "additional_kwargs": {}, "type": "human", "example": false}, {"content": " The text describes an approach in philosophy that rejects the empirical tradition, arguing that the mechanisms discussed by empiricists are not the mechanisms by which the mind reaches states of knowledge and that many theories put forward by philosophers and psychologists are open to checking by investigation but found to be wrong.", "additional_kwargs": {}, "type": "ai", "example": false}, {"content": "summarize this text:  You've said before that Enlightenment and or tradition. So it's not so much an influence, it's just a recognition and an understanding, a deeper understanding of the way I think I think we've, at least my experiences, we form our own ideas, we experience participation by our lives, work, or associations, and what we do to try to change the world and then we read things that give substance and direction and often deeper words to it. Anyhow, my experience.", "additional_kwargs": {}, "type": "human", "example": false}, {"content": " The text describes an approach in philosophy that rejects the empirical tradition and argues that the mechanisms discussed by empiricists are not the mechanisms by which the mind reaches states of knowledge. The author suggests that what is put forward in their place is similar to the rationalist tradition, with ideas such as experience conforming to our mode of cognition and organizing principles of the mind being structured by experience. However, the author also diverges from this tradition in some respects, such as the belief that the contents of the mind are introspectable and the metaphysics of dualism between mind and body.", "additional_kwargs": {}, "type": "ai", "example": false}]